{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_cacl/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "output_layer/output_layer_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output_layer/output_layer_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/layer_2_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/layer_2_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/layer_1_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/layer_1_weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "dropout/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/layer_1_weight"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/add", "op": "Add", "input": ["layer_1/MatMul", "layer_1/layer_1_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "28"}, "seed": {"i": "404"}}}, {"name": "dropout/add", "op": "Add", "input": ["dropout/random_uniform/RandomUniform", "dropout/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Floor", "op": "Floor", "input": ["dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/truediv", "op": "Mul", "input": ["ConstantFolding/dropout/truediv_recip", "dropout/Floor"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout/mul", "op": "Mul", "input": ["dropout/truediv", "layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["dropout/mul", "layer_2/layer_2_weight"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "layer_2/add", "op": "Add", "input": ["layer_2/MatMul", "layer_2/layer_2_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "output_layer/output_layer_weight"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/add", "op": "Add", "input": ["output_layer/MatMul", "output_layer/output_layer_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/Softmax", "op": "Softmax", "input": ["output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_cacl/prediction", "op": "ArgMax", "input": ["output_layer/Softmax", "accuracy_cacl/prediction/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_cacl/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "output_layer/output_layer_bias", "shape": [10], "dtype": "float32"}, {"name": "output_layer/output_layer_weight", "shape": [64, 10], "dtype": "float32"}, {"name": "layer_2/layer_2_bias", "shape": [64], "dtype": "float32"}, {"name": "layer_2/layer_2_weight", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_1/layer_1_bias", "shape": [512], "dtype": "float32"}, {"name": "layer_1/layer_1_weight", "shape": [784, 512], "dtype": "float32"}, {"name": "dropout/sub", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/dropout/truediv_recip", "shape": [], "dtype": "float32"}]}]}